#include "common.h"
#include "typedefs.h"
#include "enums.h"
#include "effect_scr.h"

// #include <cstdlib.h>
// RAND_MAX = (2**31-1)
#define RAND_MAX 2147483647

// /usr/local/sce/ee/gcc/src/newlib/libm/math/s_isnan.c
// int isnan(double x);

#include "ee/eestruct.h"
#include "ee/kernel.h"
#include "sce/libgraph.h"
#include "sce/libvu0.h"

#include "main/glob.h"
#include "graphics/graph2d/sprt.h"
#include "graphics/graph2d/tim2.h"
#include "graphics/graph2d/tim2_new.h"
#include "graphics/graph2d/effect.h"
#include "graphics/graph2d/g2d_debug.h"
#include "graphics/graph2d/effect_sub.h"
#include "graphics/graph2d/effect_obj.h"
#include "graphics/graph3d/sglib.h"
#include "graphics/graph3d/libsg.h"
#include "outgame/btl_mode/btl_mode.h"

typedef struct { // 0x28
	/* 0x00 */ u_int flow;
	/* 0x04 */ u_int cnt;
	/* 0x08 */ u_int in;
	/* 0x0c */ u_int keep;
	/* 0x10 */ u_int out;
	/* 0x14 */ u_int alp;
	/* 0x18 */ float scl;
	/* 0x1c */ float rot;
	/* 0x20 */ float cx;
	/* 0x24 */ float cy;
} EFF_BLUR;

typedef struct { // 0x18
	/* 0x00 */ u_int flow;
	/* 0x04 */ u_int cnt;
	/* 0x08 */ u_int in;
	/* 0x0c */ u_int keep;
	/* 0x10 */ u_int out;
	/* 0x14 */ u_int max;
} EFF_FOCUS;

typedef struct { // 0x4
	/* 0x0 */ u_char type;
	/* 0x1 */ u_char otype;
	/* 0x2 */ u_char init;
	/* 0x3 */ u_char pass;
} EFF_DEFORM;

typedef struct { // 0x18
	/* 0x00 */ float rrr;
	/* 0x04 */ float lll;
	/* 0x08 */ float mm1;
	/* 0x0c */ float mm2;
	/* 0x10 */ float sss;
	/* 0x14 */ float ccc;
} DEFWORK;

typedef struct { // 0xc
	/* 0x0 */ float scl;
	/* 0x4 */ short int rot;
	/* 0x6 */ short int bx;
	/* 0x8 */ short int by;
	/* 0xa */ u_char flip;
	/* 0xb */ u_char alp;
} ONE_HAND;

typedef struct { // 0xd0
	/* 0x00 */ ONE_HAND oh[16];
	/* 0xc0 */ u_long count;
	/* 0xc8 */ int wait;
	/* 0xcc */ u_int top;
} HAND_WRK;

/* bss 374f10 */ static HAND_WRK hand_wrk;
/* bss 374fe0 */ static DEFWORK dw[25][33];

/* sbss 3578fc */ static int now_loading_flow;

/* data 2809f0 */ EFF_BLUR eff_blur = {
    .flow = 3,
    .cnt = 0,
    .in = 0,
    .keep = 0,
    .out = 0,
    .alp = 0,
    .scl = 1.0,
    .rot = 180.0,
    .cx = 320.0,
    .cy = 224.0,
};
/* data 280a18 */ EFF_FOCUS eff_focus = {
    .flow = 3,
    .cnt = 0,
    .in = 0,
    .keep = 0,
    .out = 0,
    .max = 0,
};

/* sdata 356438 */ EFF_DEFORM eff_deform = {
    .type = 0,
    .otype = 0,
    .init = 0,
    .pass = 0,
};
/* sdata 356440 */ short int overlap_passflg[2] = { 0, 0 };
/* sdata 356444 */ float blur_x_offset = 0.0f; // unused ??
/* sdata 356448 */ float blur_y_offset = 0.0f; // unused ??

#define PI 3.1415927f
#define PI2 6.2831855f
#define PI_HALF 1.5707964f

#define INIT_TBP 0x1a40
#define TBP_0x8c0 (INIT_TBP / 3)

void InitEffectScr()
{
    MakeRDither3();

    SetParam(0, 0, 0, 0, 0, 0);
