#include "common.h"
#include "typedefs.h"
#include "effect_sub2.h"
#include "enums.h"

#include "ee/eestruct.h"
#include "sce/libvu0.h"

#include "main/glob.h"
#include "os/eeiop/eese.h"
#include "os/eeiop/cdvd/eecdvd.h"
#include "os/eeiop/adpcm/ea_dat.h"
#include "os/eeiop/adpcm/ea_ctrl.h"
#include "os/eeiop/adpcm/ea_btlmode.h"
// #include "os/eeiop/adpcm/ea_cmd.h" // do not include the declaration for `EAdpcmCmdPlay`
#include "ingame/menu/item.h"
#include "ingame/menu/ig_menu.h"
#include "ingame/event/ev_main.h"
// #include "ingame/plyr/plyr_ctl.h" // do not include the declaration for `FinderEndSet`
#include "outgame/mode_slct.h"
#include "outgame/btl_mode/btl_dat.h"
#include "outgame/btl_mode/btl_mode.h"
#include "graphics/graph2d/sprt.h"
#include "graphics/graph2d/tim2.h"
#include "graphics/graph2d/effect.h"
#include "graphics/graph2d/message.h"
#include "graphics/graph2d/tim2_new.h"
#include "graphics/graph2d/effect_sub.h"
#include "graphics/graph2d/effect_scr.h"
#include "graphics/graph2d/effect_obj.h"
#include "graphics/graph3d/sglib.h"

typedef struct { // 0x8
	/* 0x0 */ void *start_point;
	/* 0x4 */ short int start_num;
	/* 0x6 */ short int end_num;
} ANM_WRK;

typedef struct { // 0x40
	/* 0x00 */ sceVu0FVECTOR fall_speed;
	/* 0x10 */ sceVu0IVECTOR wind;
	/* 0x20 */ sceVu0FVECTOR rotate;
	/* 0x30 */ int stop_time;
	/* 0x34 */ short int r;
	/* 0x36 */ short int g;
	/* 0x38 */ short int b;
	/* 0x3a */ short int a;
} FALL_TABLE;

typedef struct { // 0x17b0
	/* 0x0000 */ sceVu0FVECTOR mpos_keep;
	/* 0x0010 */ void *pos_p;
	/* 0x0014 */ short int at_ground[600];
	/* 0x04c4 */ short int rgba[600][4];
	/* 0x1784 */ int fnum_keep;
	/* 0x1788 */ int fall_count;
	/* 0x178c */ float fall_rate;
	/* 0x1790 */ float rate_remain;
	/* 0x1794 */ short int mode_keep;
	/* 0x1796 */ short int area_keep;
	/* 0x1798 */ short int dist;
	/* 0x179a */ short int init_flg;
	/* 0x179c */ short int offs[3];
} LEAVES_TABLE;

typedef struct { // 0x10
	/* 0x0 */ u_long tex_keep;
	/* 0x8 */ short int tm2_id;
	/* 0xa */ short int mode;
	/* 0xc */ short int load_id;
	/* 0xe */ short int pad;
} BTL_ANM_LOAD;

/* sdata 356430 */ enum T_LOAD_MODE {
	BANM_NORM = 0,
	BANM_LOAD = 1,
	BANM_AFTLOAD = 2,
	BANM_TEXDISP = 3
};

#define PI 3.1415927f
#define PI_HALF 1.5707964f

#define ANM2D_DAT_TABLE_P(table_p) ((ANM2D_DAT_TABLE *)table_p)
#define ANM2D_WRK_TABLE_P(table_p) ((ANM2D_WRK_TABLE *)table_p)

#include "data/fall_table.h" /* data 270e30 */ // FALL_TABLE fall_table[/*4*/];
/* sdata 3563e8 */ short int fallen_effect_switch = 0;
/* sdata 3563ea */ short int gus_effect_switch = 0;
/* sdata 3563ec */ short int hole_effect_switch = 0;
/* sdata 3563f0 */ short int line_effect_switch[4] = { 0, 0, 0, 0 };

#include "data/btl_strt.h"  /* data 270f30 */ // SPRT_SDAT btl_strt[11];
#include "data/btl_rslt.h"  /* data 270fd0 */ // SPRT_SDAT btl_rslt[23];
#include "data/msg_strt.h"  /* data 271118 */ // SPRT_SDAT msg_strt;
#include "data/btl_msel.h"  /* data 271128 */ // SPRT_SDAT btl_msel[/*26*/];
